tap "caskroom/cask"
tap "caskroom/versions"
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"
tap "pharo-project/pharo"

cask "font-dejavu-sans"
cask "font-bitstream-vera"
cask "font-courier-prime"
cask "font-input"
cask "gimp"
cask "google-chrome"
cask "java"
cask "java8"
cask "pharo-launcher"
cask "visual-studio-code"
cask "slack"
cask "spotify"
cask "vlc"

brew "git"
brew "gnutls"
brew "markdown"
brew "pandoc"

mas "1Password 7", id: 1333542190
mas "Evernote", id:  406056744
mas "TextWrangler", id:  404010395

# programming
cask "java"
cask "java8"
cask "pharo-launcher"
cask "visual-studio-code"
cask "vmware-fusion"

brew "ant"
brew "elixir"
brew "emacs", args: ["with-cocoa", "with-gnutls"]
brew "gradle"
brew "jenv"
brew "kotlin"
brew "maven"
brew "python3"

# Mobile
cask "android-studio"


# fonts
# Patrick Hand
# https://www.roads.org.uk/sites/default/files/pages/fonts/transportmedium.zip
# https://www.roads.org.uk/sites/default/files/pages/fonts/transportheavy.zip
# https://github.com/tonsky/FiraCode

