tap "caskroom/cask"
tap "caskroom/versions"
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"
tap "pharo-project/pharo"

cask "firefox"
cask "font-dejavu-sans"
cask "font-bitstream-vera"
cask "font-courier-prime"
cask "font-fira-code"
cask "font-input"
cask "gimp"
cask "google-chrome"
cask "pharo-launcher"
cask "visual-studio-code"
cask "slack"
cask "spotify"
cask "vlc"

brew "git"
brew "gnutls"
brew "markdown"
brew "pandoc"
brew "wget"

mas "1Password 7", id: 1333542190
mas "Evernote", id:  406056744
mas "TextWrangler", id:  404010395

# programming
cask "emacs"
cask "caskroom/versions/java8"
cask "pharo-launcher"
cask "visual-studio-code"

brew "ant"
brew "elixir"
brew "gradle"
brew "jenv"
brew "kotlin"
brew "maven"
brew "python3"
brew "rust"
brew "rustup"

# Docker
cask "docker"
brew "bash-completion"
brew "docker-completion"
brew "docker-compose-completion"
brew "docker-machine-completion"

# courseware
brew "fop"
brew "saxon"

# Mobile
cask "android-studio"

# Installations managed by IT
# cask "vmware-fusion"

# fonts
# https://fonts.google.com/specimen/Patrick+Hand
# https://www.roads.org.uk/sites/default/files/pages/fonts/transportmedium.zip
# https://www.roads.org.uk/sites/default/files/pages/fonts/transportheavy.zip
# https://github.com/tonsky/FiraCode

